In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [4]:
np.random.seed(101) #set seed, so we always get same random numbers

In [8]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'], ['W','X','Y','Z']) #DataFrame(data, index, columns)
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

Each of these columns W, X, Y, Z is actually a pandas series, and they all share a common index. <br>
That's all dataframes are, they are a bunch of series that share a common index

In [9]:
#grab the W columns
df['W'] #df.W also works, similar to SQL, but don't do this as you can confuse it with df functions
#note how this looks like a pandas series, because it is one.

A    0.386030
B    0.681209
C   -1.005187
D   -1.382920
E    0.992573
Name: W, dtype: float64

In [13]:
type(df['W']) #confirmed, it's a series

pandas.core.series.Series

In [14]:
type(df)

pandas.core.frame.DataFrame

In [15]:
#getting multiple columns
df[['W','Z']]
#we are actually getting back a DataFrame, not Series.

          W         Z
A  0.386030  0.230336
B  0.681209  1.939932
C -1.005187 -0.732845
D -1.382920 -2.141212
E  0.992573  1.292765

### Create new columns:

In [23]:
#Create a new column, can create it using other columns
df['new_col'] = df['X'] + df['Y']
df

          W         X         Y         Z   new_col
A  0.386030  2.084019 -0.376519  0.230336  1.707500
B  0.681209  1.035125 -0.031160  1.939932  1.003965
C -1.005187 -0.741790  0.187125 -0.732845 -0.554665
D -1.382920  1.482495  0.961458 -2.141212  2.443954
E  0.992573  1.192241 -1.046780  1.292765  0.145461

### Drop columns:
In the drop method, axis=0 is default, which refers to index (rows). <br>
So if we want to drop a column, we need to specify axis=1.

In [24]:
df.drop('new_col', axis=1) #does not do it in-place by default

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [25]:
df #so the drop above did not affect original df

          W         X         Y         Z   new_col
A  0.386030  2.084019 -0.376519  0.230336  1.707500
B  0.681209  1.035125 -0.031160  1.939932  1.003965
C -1.005187 -0.741790  0.187125 -0.732845 -0.554665
D -1.382920  1.482495  0.961458 -2.141212  2.443954
E  0.992573  1.192241 -1.046780  1.292765  0.145461

Pandas DF by defauly inplace=False to not accidentally lose information. <br>
So you have to explicityl set inplace=True to make drop in-place and change original df.

In [26]:
df.drop('new_col', axis=1, inplace=True)
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [27]:
df.drop('E', axis=0) #note: not in place

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212

Why are rows axis=0 and columns axis=1? <br>
Comes back to numpy. DF are like a fancy index marker on top of numpy arrays. It is directly taken from the shape, just as you would have an numpy array: <br>
df.shape <br>
(5,4) -> 5 rows, 4 columns <br>
This means the rows is the 0th index of the tuple above, and the columns are the 1st index. <br>

In [28]:
df.shape

(5, 4)

### Select rows:
2 methods:

In [32]:
# Select based on name of row
df.loc['C'] 
#The below shows that the rows are series as well when they are returned

W   -1.005187
X   -0.741790
Y    0.187125
Z   -0.732845
Name: C, dtype: float64

In [31]:
df.iloc[2] #select row by index

W   -1.005187
X   -0.741790
Y    0.187125
Z   -0.732845
Name: C, dtype: float64

### Select subsets of rows and columns:

In [33]:
df.loc['D','X'] #I want value at row D, column X

1.48249549608345

In [34]:
df.iloc[3,1] #same thing as above but using indices

1.48249549608345

In [35]:
df.loc[['B','C'],['X','Z']] #want A,B rows with X,Z columns

          X         Z
B  1.035125  1.939932
C -0.741790 -0.732845

*Part 2 below!*

### Conditional selection:

In [37]:
bool_df = df > 0 #similar to the conditional selection applied to numpy arrays
bool_df

       W      X      Y      Z
A   True   True  False   True
B   True   True  False   True
C  False  False   True  False
D  False   True   True  False
E   True   True  False   True

In [38]:
df[bool_df] #extracts the values that are true, leaves the false values as NaN

          W         X         Y         Z
A  0.386030  2.084019       NaN  0.230336
B  0.681209  1.035125       NaN  1.939932
C       NaN       NaN  0.187125       NaN
D       NaN  1.482495  0.961458       NaN
E  0.992573  1.192241       NaN  1.292765

In [39]:
df['W']

A    0.386030
B    0.681209
C   -1.005187
D   -1.382920
E    0.992573
Name: W, dtype: float64

In [40]:
df[df['W'] > 0] #this filters out the rows where the value is not greater than 0 (hence false)
#If you do the condition based on columns, you only get series back, not those NaN values.

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
E  0.992573  1.192241 -1.046780  1.292765

In [41]:
#e.g. grab all rows where value of Z is < 0
df[df['Z'] < 0]

          W         X         Y         Z
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212

In [42]:
result_df = df[df['W'] > 0]
result_df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
E  0.992573  1.192241 -1.046780  1.292765

In [44]:
#since a dataframe is returned from the above result, we can perform things on it, like grabbing columns...whatnot
result_df['X']

A    2.084019
B    1.035125
E    1.192241
Name: X, dtype: float64

In [45]:
#or just in one line...
df[df['W'] > 0][['X','Y']]
#one benefit compared to doing it in steps is that the variables you create if you do in steps all take up memory
#Also it's acutally easier to read in one line, too many variable names clog the screen up and confuses me...

          X         Y
A  2.084019 -0.376519
B  1.035125 -0.031160
E  1.192241 -1.046780

Why the below won't work: <br>
```python
df[(df['W'] > 0) and (df['Y'] > 1)]
```
Because we cannot compare a series of boolean values with another series of boolean values. <br>
The 'and' operator can only take into account single boolean values at a time, so e.g. `True and False`

In [52]:
#So whatwe actually use is:
df[(df['W'] > 0) & (df['Y'] > -1)]

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932

In [50]:
#This is OR:
df[(df['W'] > 0) | (df['Y'] > -1)]

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

#### (Re)setting index:

In [53]:
df #just putting original df here

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [54]:
df.reset_index()
#this puts old index as a column of our df, and the actual index turns back to the default numerical 0,1,2...
#This does NOT HAPPEN INPLACE
# Can do df.reset_index(inplace=True)

  index         W         X         Y         Z
0     A  0.386030  2.084019 -0.376519  0.230336
1     B  0.681209  1.035125 -0.031160  1.939932
2     C -1.005187 -0.741790  0.187125 -0.732845
3     D -1.382920  1.482495  0.961458 -2.141212
4     E  0.992573  1.192241 -1.046780  1.292765

In [56]:
new_index = 'CA NY WY OR CO'.split()
new_index
#smart way to make a list without having to list everything

['CA', 'NY', 'WY', 'OR', 'CO']

In [57]:
df['States'] = new_index

In [58]:
df

          W         X         Y         Z States
A  0.386030  2.084019 -0.376519  0.230336     CA
B  0.681209  1.035125 -0.031160  1.939932     NY
C -1.005187 -0.741790  0.187125 -0.732845     WY
D -1.382920  1.482495  0.961458 -2.141212     OR
E  0.992573  1.192241 -1.046780  1.292765     CO

In [59]:
#makes 'States' our new index
df.set_index('States') #again, by default, not inplace

               W         X         Y         Z
States
CA      0.386030  2.084019 -0.376519  0.230336
NY      0.681209  1.035125 -0.031160  1.939932
WY     -1.005187 -0.741790  0.187125 -0.732845
OR     -1.382920  1.482495  0.961458 -2.141212
CO      0.992573  1.192241 -1.046780  1.292765

*Part 3 is below!*

### Multi-index dataframes (Index hierarchy):

In [61]:
#given code to work with
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [65]:
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [66]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

`pd.MultiIndex.from_tuples` won't be used too often in this course, but it's just a way to take a list of tuples and make a multi-index from it

In [68]:
df = pd.DataFrame(randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  0.641806 -0.905100
   2 -0.391157  1.028293
   3 -1.972605 -0.866885
G2 1  0.720788 -1.223082
   2  1.606780 -1.115710
   3 -1.385379 -1.329660

This is essentially 'multiple levels' of indexes. G1 and G2 on the outer, and 1,2,3 on the inside

In [73]:
#note: just a reminder, randn(6,2) returns numpy array of 6 rows by 2 columns (so 12 elements) of random numbers plucked from the normal distribution
randn(6,2)

array([[ 0.90239776,  0.16178119],
       [ 0.83302932,  0.97571968],
       [-0.3882387 ,  0.78331605],
       [-0.70895374,  0.5868473 ],
       [-1.62134783,  0.67753511],
       [ 0.02610548, -1.67828366]])

#### How to call data from a multi-level index:

In [74]:
df.loc['G1']

          A         B
1  0.641806 -0.905100
2 -0.391157  1.028293
3 -1.972605 -0.866885

In [75]:
df.loc['G1'].loc[2]
#call from outside index first, then continue deeper into each level

A   -0.391157
B    1.028293
Name: 2, dtype: float64

In [76]:
df.index.names
#all FrozenList([None, None]) says is that both indices, G1/G2 and 1/2/3 doesn't have names yet

FrozenList([None, None])

In [77]:
df.index.names = ['Groups', 'Num']

In [78]:
df

                   A         B
Groups Num
G1     1    0.641806 -0.905100
       2   -0.391157  1.028293
       3   -1.972605 -0.866885
G2     1    0.720788 -1.223082
       2    1.606780 -1.115710
       3   -1.385379 -1.329660

In [79]:
#get G2, row with index label 2, the value of B
df.loc['G2'].loc[2]['B']

-1.1157099674628352

**Cross-section:** <br>
Useful for multi-level index

In [80]:
df.xs('G1')

            A         B
Num
1    0.641806 -0.905100
2   -0.391157  1.028293
3   -1.972605 -0.866885

Let's say we want to grab the 1st row of both G1 and G2, hard to do for square bracket [] method, but easy for xs:

In [82]:
df.xs(1,level='Num')
#This grabs a cross-section where the level we want is 'Num', and Num == 1.

               A         B
Groups
G1      0.641806 -0.905100
G2      0.720788 -1.223082